blog/snails-to-small.org
#+TITLE:       snails 在 Doom 下的bug
#+AUTHOR:      lampze
#+EMAIL:       1229408499@qq.com
#+DATE:        2020-03-04 三
#+URI:         /blog/%y/%m/%d/snails-to-small
#+KEYWORDS:    snails,Emacs,Doom
#+TAGS:        snails,Emacs,Doom
#+LANGUAGE:    zh
#+OPTIONS:     H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: snails报错(split-window: Window #<window 9 on  *snails tips*> too small for splitting)的解决办法

* 问题
自从 snails 加入了 tips 后，在 Doom 里 snails 就打不开了，会报错 =split-window:
Window #<window 9 on  *snails tips*> too small for splitting=

但在 =emacs -q= 下就完全没有问题

* 原因
经过一番调试，发现是因为 =(line-pixel-height)= 返回的值太小了，导致不能分割窗口。

* 解决
两种方法
1. 修改源码把 =(line-pixel-height)= 改成可以分割的值，比如在原基础上乘二，但以后
   更新就比较难维护

2. 把字体调大，snails 调字体需要配置 face。
#+BEGIN_SRC elisp
(def-package! snails
  ;; 要在载入完之后修改face
  :config
  (set-face-attribute 'snails-content-buffer-face nil :height 240))
#+END_SRC
